GalusPeres/ESP32-P4-HomeAssistant-Display/src/video/camera_stream.cpp
#include "src/video/camera_stream.h"

#include <esp_heap_caps.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <soc/soc_caps.h>

#include "src/core/config_manager.h"
#include "src/core/i18n.h"
#include "src/network/network_manager.h"

#if defined(CONFIG_IDF_TARGET_ESP32P4) && \
    defined(SOC_JPEG_DECODE_SUPPORTED) && SOC_JPEG_DECODE_SUPPORTED

#include <driver/jpeg_decode.h>
#include <fcntl.h>
#include <lwip/netdb.h>
#include <lwip/sockets.h>

#include <algorithm>
#include <cerrno>
#include <cstdlib>
#include <cstring>
#include <strings.h>

#include "src/core/dma2d_arbiter.h"
#include "src/devices/device.h"
#include "src/video/camera_geometry.h"

namespace {

constexpr uint16_t kWidth = camera_geometry::kWidth;
constexpr uint16_t kHeight = camera_geometry::kHeight;
constexpr uint16_t kDecodedWidth = camera_geometry::kDecodedWidth;
constexpr uint16_t kDecodedHeight = camera_geometry::kDecodedHeight;
constexpr size_t kPixelBytes =
    static_cast<size_t>(kDecodedWidth) * kDecodedHeight * sizeof(uint16_t);
constexpr size_t kMaxJpegBytes = 256U * 1024U;
constexpr uint8_t kFrameBufferCount = 2;
constexpr uint32_t kHttpHeaderTimeoutMs = 5000;
constexpr int kHttpReceiveBufferBytes = 4 * 1024;
constexpr uint32_t kHttpConnectTimeoutMs = 4000;
constexpr uint32_t kSocketPollTimeoutMs = 250;
constexpr size_t kHttpHeaderBytes = 4 * 1024;
constexpr size_t kMinCameraDmaHeadroomBytes = 24 * 1024;
constexpr uint32_t kDmaHeadroomGraceMs = 250;
constexpr char kJpegFraming[] = "be32-jpeg";

enum class FrameState : uint8_t {
  Free,
  Writing,
  Ready,
  Displayed,
};

portMUX_TYPE g_state_mux = portMUX_INITIALIZER_UNLOCKED;
TaskHandle_t g_task = nullptr;
volatile bool g_stop_requested = false;
bool g_release_buffers = false;
String g_url;
uint16_t* g_pixels[kFrameBufferCount] = {};
lv_image_dsc_t g_images[kFrameBufferCount] = {};
FrameState g_frame_states[kFrameBufferCount] = {};
int8_t g_displayed_index = -1;
uint32_t g_status_sequence = 0;
uint32_t g_ui_status_sequence = 0;
char g_status[96] = "";
bool g_status_error = false;
uint32_t g_worker_frame_count = 0;

// Keep the engine alive across popup opens. Creating/deleting JPEG engines
// repeatedly churns the 2D-DMA pool shared with the display PPA.
jpeg_decoder_handle_t g_jpeg_decoder = nullptr;

static const i18n::Strings& camera_text() {
  return i18n::strings(configManager.getConfig().language);
}

static void set_status(const char* text, bool error = false) {
  Serial.printf("[CameraStream] Status%s: %s\n",
                error ? " FEHLER" : "",
                text ? text : "");
  portENTER_CRITICAL(&g_state_mux);
  snprintf(g_status, sizeof(g_status), "%s", text ? text : "");
  g_status_error = error;
  ++g_status_sequence;
  portEXIT_CRITICAL(&g_state_mux);
}

static bool task_is_active() {
  portENTER_CRITICAL(&g_state_mux);
  const bool active = g_task != nullptr;
  portEXIT_CRITICAL(&g_state_mux);
  return active;
}

static void release_frame_buffers() {
  uint16_t* buffers[kFrameBufferCount] = {};
  portENTER_CRITICAL(&g_state_mux);
  for (uint8_t i = 0; i < kFrameBufferCount; ++i) {
    buffers[i] = g_pixels[i];
    g_pixels[i] = nullptr;
    memset(&g_images[i], 0, sizeof(g_images[i]));
    g_frame_states[i] = FrameState::Free;
  }
  g_displayed_index = -1;
  portEXIT_CRITICAL(&g_state_mux);

  for (uint8_t i = 0; i < kFrameBufferCount; ++i) {
    free(buffers[i]);
  }
}

static bool ensure_frame_buffers() {
  for (uint8_t i = 0; i < kFrameBufferCount; ++i) {
    if (g_pixels[i]) continue;

    jpeg_decode_memory_alloc_cfg_t memory_config{};
    memory_config.buffer_direction = JPEG_DEC_ALLOC_OUTPUT_BUFFER;
    size_t allocated_bytes = 0;
    g_pixels[i] = static_cast<uint16_t*>(
        jpeg_alloc_decoder_mem(kPixelBytes, &memory_config, &allocated_bytes));
    if (!g_pixels[i] || allocated_bytes < kPixelBytes) {
      free(g_pixels[i]);
      g_pixels[i] = nullptr;
      set_status(camera_text().camera_frame_memory_failed, true);
      release_frame_buffers();
      return false;
    }

    memset(g_pixels[i], 0, kPixelBytes);
    memset(&g_images[i], 0, sizeof(g_images[i]));
    g_images[i].header.magic = LV_IMAGE_HEADER_MAGIC;
    g_images[i].header.cf = LV_COLOR_FORMAT_RGB565_SWAPPED;
    g_images[i].header.w = kWidth;
    g_images[i].header.h = kHeight;
    g_images[i].header.stride = kDecodedWidth * sizeof(uint16_t);
    g_images[i].data_size = kPixelBytes;
    g_images[i].data =
        reinterpret_cast<const uint8_t*>(g_pixels[i]);
    g_frame_states[i] = FrameState::Free;
  }
  return true;
}

static int8_t acquire_write_buffer() {
  int8_t selected = -1;
  portENTER_CRITICAL(&g_state_mux);
  for (uint8_t i = 0; i < kFrameBufferCount; ++i) {
    if (g_frame_states[i] == FrameState::Free) {
      selected = static_cast<int8_t>(i);
      break;
    }
  }
  if (selected < 0) {
    // A frame not yet shown by LVGL is safe to replace. The buffer currently
    // displayed is never written by the decoder task.
    for (uint8_t i = 0; i < kFrameBufferCount; ++i) {
      if (g_frame_states[i] == FrameState::Ready) {
        selected = static_cast<int8_t>(i);
        break;
      }
    }
  }
  if (selected >= 0) {
    g_frame_states[selected] = FrameState::Writing;
  }
  portEXIT_CRITICAL(&g_state_mux);
  return selected;
}

static void publish_write_buffer(int8_t index) {
  if (index < 0 || index >= static_cast<int8_t>(kFrameBufferCount)) return;
  portENTER_CRITICAL(&g_state_mux);
  g_frame_states[index] = FrameState::Ready;
  portEXIT_CRITICAL(&g_state_mux);
}

static void release_write_buffer(int8_t index) {
  if (index < 0 || index >= static_cast<int8_t>(kFrameBufferCount)) return;
  portENTER_CRITICAL(&g_state_mux);
  if (g_frame_states[index] == FrameState::Writing) {
    g_frame_states[index] = FrameState::Free;
  }
  portEXIT_CRITICAL(&g_state_mux);
}

static bool ensure_jpeg_decoder() {
  if (g_jpeg_decoder) return true;

  jpeg_decode_engine_cfg_t engine_config{};
  engine_config.intr_priority = 0;
  engine_config.timeout_ms = 500;
  const esp_err_t result =
      jpeg_new_decoder_engine(&engine_config, &g_jpeg_decoder);
  if (result != ESP_OK || !g_jpeg_decoder) {
    g_jpeg_decoder = nullptr;
    Serial.printf("[CameraStream] JPEG-Engine konnte nicht starten: %s\n",
                  esp_err_to_name(result));
    set_status(camera_text().camera_decoder_start_failed, true);
    return false;
  }
  Serial.println("[CameraStream] JPEG-Hardwaredecoder bereit");
  return true;
}

static bool decode_jpeg_frame(const uint8_t* jpeg, size_t jpeg_bytes) {
  if (!jpeg || jpeg_bytes < 4 || jpeg_bytes > UINT32_MAX ||
      jpeg[0] != 0xFF || jpeg[1] != 0xD8 ||
      jpeg[jpeg_bytes - 2] != 0xFF || jpeg[jpeg_bytes - 1] != 0xD9) {
    Serial.printf("[CameraStream] Ungueltiger JPEG-Frame: %u Bytes\n",
                  static_cast<unsigned>(jpeg_bytes));
    set_status(camera_text().camera_invalid_response, true);
    return false;
  }

  jpeg_decode_picture_info_t picture_info{};
  esp_err_t result = jpeg_decoder_get_info(
      jpeg, static_cast<uint32_t>(jpeg_bytes), &picture_info);
  if (result != ESP_OK ||
      picture_info.width != kWidth || picture_info.height != kHeight) {
    Serial.printf(
        "[CameraStream] JPEG-Format ungueltig: decode=%s size=%ux%u\n",
        esp_err_to_name(result),
        static_cast<unsigned>(picture_info.width),
        static_cast<unsigned>(picture_info.height));
    set_status(camera_text().camera_invalid_response, true);
    return false;
  }

  if (!ensure_jpeg_decoder()) return false;
  const int8_t index = acquire_write_buffer();
  if (index < 0) return true;

