GalusPeres/ESP32-P4-HomeAssistant-Display/src/video/camera_stream.cpp
  jpeg_decode_cfg_t decode_config{};
  decode_config.output_format = JPEG_DECODE_OUT_FORMAT_RGB565;
  // RGB order produces the byte layout represented by
  // LV_COLOR_FORMAT_RGB565_SWAPPED on the little-endian P4.
  decode_config.rgb_order = JPEG_DEC_RGB_ELEMENT_ORDER_RGB;
  decode_config.conv_std = JPEG_YUV_RGB_CONV_STD_BT601;

  const uint32_t decode_started_ms = millis();
  uint32_t decoded_bytes = 0;
  {
    // JPEG and display PPA share the P4's 2D-DMA pool. Skipping a frame on
    // timeout is safe; decoding concurrently is not.
    Dma2dArbiterGuard dma2d_guard(500);
    if (!dma2d_guard.locked()) {
      release_write_buffer(index);
      Serial.println("[CameraStream] JPEG ausgelassen: 2D-DMA belegt");
      return true;
    }
    result = jpeg_decoder_process(
        g_jpeg_decoder,
        &decode_config,
        jpeg,
        static_cast<uint32_t>(jpeg_bytes),
        reinterpret_cast<uint8_t*>(g_pixels[index]),
        static_cast<uint32_t>(kPixelBytes),
        &decoded_bytes);
    if (result != ESP_OK || decoded_bytes < kPixelBytes) {
      // Discard a potentially wedged decoder while the DMA arbiter is still
      // held. The next popup/frame creates a clean engine.
      jpeg_del_decoder_engine(g_jpeg_decoder);
      g_jpeg_decoder = nullptr;
    }
  }

  if (result != ESP_OK || decoded_bytes < kPixelBytes) {
    release_write_buffer(index);
    Serial.printf(
        "[CameraStream] JPEG-Decode fehlgeschlagen: %s bytes=%u/%u\n",
        esp_err_to_name(result),
        static_cast<unsigned>(decoded_bytes),
        static_cast<unsigned>(kPixelBytes));
    set_status(camera_text().camera_decoder_error, true);
    return false;
  }

  publish_write_buffer(index);
  ++g_worker_frame_count;
  if (g_worker_frame_count == 1) {
    Serial.printf(
        "[CameraStream] Erstes Bild dekodiert: jpeg=%u Bytes decode=%ums "
        "int=%uKB largest=%uKB psram=%uKB\n",
        static_cast<unsigned>(jpeg_bytes),
        static_cast<unsigned>(millis() - decode_started_ms),
        static_cast<unsigned>(
            heap_caps_get_free_size(MALLOC_CAP_INTERNAL) / 1024U),
        static_cast<unsigned>(
            heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL) / 1024U),
        static_cast<unsigned>(
            heap_caps_get_free_size(MALLOC_CAP_SPIRAM) / 1024U));
    set_status(camera_text().camera_ready);
  }
  return true;
}

// Receives the HomeTiles record stream after HttpChunkedBodyDecoder has
// removed HTTP/1.1 chunk framing. Each record is a big-endian uint32 length
// followed by exactly one complete JPEG frame.
class JpegRecordStream final : public Stream {
 public:
  explicit JpegRecordStream(uint8_t* input)
      : input_(input),
        last_fps_ms_(millis()) {}

  size_t write(uint8_t value) override {
    return write(&value, 1);
  }

  size_t write(const uint8_t* data, size_t len) override {
    if (!data || len == 0) return 0;
    if (g_stop_requested || failed_) return 0;
    const size_t accepted = len;

    while (len > 0 && !failed_ && !g_stop_requested) {
      if (length_bytes_ < sizeof(length_header_)) {
        const size_t take =
            std::min(len, sizeof(length_header_) - length_bytes_);
        memcpy(length_header_ + length_bytes_, data, take);
        length_bytes_ += take;
        data += take;
        len -= take;
        if (length_bytes_ < sizeof(length_header_)) continue;

        expected_bytes_ =
            (static_cast<size_t>(length_header_[0]) << 24) |
            (static_cast<size_t>(length_header_[1]) << 16) |
            (static_cast<size_t>(length_header_[2]) << 8) |
            static_cast<size_t>(length_header_[3]);
        buffered_ = 0;
        if (expected_bytes_ == 0) {
          length_bytes_ = 0;
          if (!received_flush_record_) {
            received_flush_record_ = true;
            Serial.println("[CameraStream] Bridge-Flush-Record empfangen");
          }
          continue;
        }
        if (expected_bytes_ > kMaxJpegBytes) {
          Serial.printf(
              "[CameraStream] JPEG-Frame zu gross: %u > %u Bytes\n",
              static_cast<unsigned>(expected_bytes_),
              static_cast<unsigned>(kMaxJpegBytes));
          set_status(camera_text().camera_input_buffer_full, true);
          failed_ = true;
          break;
        }
      }

      const size_t take =
          std::min(len, expected_bytes_ - buffered_);
      memcpy(input_ + buffered_, data, take);
      buffered_ += take;
      data += take;
      len -= take;
      if (buffered_ < expected_bytes_) continue;

      if (!received_first_frame_) {
        received_first_frame_ = true;
        Serial.printf(
            "[CameraStream] Erster vollstaendiger JPEG-Frame: %u Bytes "
            "int=%uKB largest=%uKB psram=%uKB\n",
            static_cast<unsigned>(expected_bytes_),
            static_cast<unsigned>(
                heap_caps_get_free_size(MALLOC_CAP_INTERNAL) / 1024U),
            static_cast<unsigned>(
                heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL) /
                1024U),
            static_cast<unsigned>(
                heap_caps_get_free_size(MALLOC_CAP_SPIRAM) / 1024U));
      }

      const uint32_t frames_before = g_worker_frame_count;
      if (!decode_jpeg_frame(input_, expected_bytes_)) {
        failed_ = true;
        break;
      }
      frame_count_ += g_worker_frame_count - frames_before;
      length_bytes_ = 0;
      expected_bytes_ = 0;
      buffered_ = 0;

      const uint32_t now = millis();
      if (now - last_fps_ms_ >= 2000) {
        const float fps =
            static_cast<float>(frame_count_) * 1000.0f /
            static_cast<float>(now - last_fps_ms_);
        char message[64];
        snprintf(message, sizeof(message), camera_text().camera_fps_fmt, fps);
        set_status(message);
        frame_count_ = 0;
        last_fps_ms_ = now;
      }
      taskYIELD();
    }
    return failed_ ? 0 : accepted;
  }

  int available() override { return 0; }
  int read() override { return -1; }
  int peek() override { return -1; }
  void flush() override {}

