GalusPeres/ESP32-P4-HomeAssistant-Display/src/video/camera_stream.cpp
 private:
  uint8_t* input_;
  uint8_t length_header_[4] = {};
  size_t length_bytes_ = 0;
  size_t expected_bytes_ = 0;
  size_t buffered_ = 0;
  uint32_t frame_count_ = 0;
  uint32_t last_fps_ms_ = 0;
  bool received_flush_record_ = false;
  bool received_first_frame_ = false;
  bool failed_ = false;
};

class HttpChunkedBodyDecoder {
 public:
  bool feed(const uint8_t* raw, size_t len, JpegRecordStream& output) {
    size_t offset = 0;
    while (offset < len && state_ != State::Done) {
      switch (state_) {
        case State::SizeLine: {
          const char ch = static_cast<char>(raw[offset++]);
          if (ch == '\n') {
            if (!parse_size_line()) return fail("ungueltige Chunk-Groesse");
            size_line_len_ = 0;
            state_ = chunk_remaining_ == 0 ? State::Done : State::Data;
          } else if (ch != '\r') {
            if (size_line_len_ + 1 >= sizeof(size_line_)) {
              return fail("Chunk-Groessenzeile zu lang");
            }
            size_line_[size_line_len_++] = ch;
          }
          break;
        }
        case State::Data: {
          const size_t take =
              std::min(chunk_remaining_, len - offset);
          if (output.write(raw + offset, take) != take) return false;
          offset += take;
          chunk_remaining_ -= take;
          if (chunk_remaining_ == 0) state_ = State::DataCr;
          break;
        }
        case State::DataCr:
          if (raw[offset++] != '\r') {
            return fail("CR nach Chunk fehlt");
          }
          state_ = State::DataLf;
          break;
        case State::DataLf:
          if (raw[offset++] != '\n') {
            return fail("LF nach Chunk fehlt");
          }
          state_ = State::SizeLine;
          break;
        case State::Done:
          break;
      }
    }
    return state_ != State::Done;
  }

 private:
  enum class State : uint8_t {
    SizeLine,
    Data,
    DataCr,
    DataLf,
    Done,
  };

  bool parse_size_line() {
    size_t index = 0;
    while (index < size_line_len_ &&
           (size_line_[index] == ' ' || size_line_[index] == '\t')) {
      ++index;
    }
    uint32_t value = 0;
    bool have_digit = false;
    for (; index < size_line_len_; ++index) {
      const char ch = size_line_[index];
      if (ch == ';' || ch == ' ' || ch == '\t') break;
      uint8_t digit = 0;
      if (ch >= '0' && ch <= '9') {
        digit = static_cast<uint8_t>(ch - '0');
      } else if (ch >= 'a' && ch <= 'f') {
        digit = static_cast<uint8_t>(ch - 'a' + 10);
      } else if (ch >= 'A' && ch <= 'F') {
        digit = static_cast<uint8_t>(ch - 'A' + 10);
      } else {
        return false;
      }
      if (value > (UINT32_MAX - digit) / 16U) return false;
      value = value * 16U + digit;
      have_digit = true;
    }
    if (!have_digit) return false;
    chunk_remaining_ = value;
    return true;
  }

  bool fail(const char* reason) {
    Serial.printf("[CameraStream] HTTP-Chunk-Fehler: %s\n", reason);
    set_status(camera_text().camera_connection_ended, true);
    state_ = State::Done;
    return false;
  }

  State state_ = State::SizeLine;
  char size_line_[32] = {};
  size_t size_line_len_ = 0;
  size_t chunk_remaining_ = 0;
};

struct HttpEndpoint {
  char host[128] = {};
  char path[320] = {};
  uint16_t port = 80;
};

static bool parse_http_url(const char* url, HttpEndpoint& endpoint) {
  constexpr char kScheme[] = "http://";
  if (!url || strncmp(url, kScheme, sizeof(kScheme) - 1) != 0) return false;
  const char* authority = url + sizeof(kScheme) - 1;
  const char* path = strchr(authority, '/');
  const char* authority_end = path ? path : authority + strlen(authority);
  if (authority == authority_end ||
      memchr(authority, '@', authority_end - authority)) {
    return false;
  }

  const char* host_begin = authority;
  const char* host_end = authority_end;
  const char* port_begin = nullptr;
  if (*host_begin == '[') {
    ++host_begin;
    host_end = static_cast<const char*>(
        memchr(host_begin, ']', authority_end - host_begin));
    if (!host_end) return false;
    const char* after_bracket = host_end + 1;
    if (after_bracket < authority_end) {
      if (*after_bracket != ':') return false;
      port_begin = after_bracket + 1;
    }
  } else {
    const char* colon = static_cast<const char*>(
        memchr(authority, ':', authority_end - authority));
    if (colon) {
      host_end = colon;
      port_begin = colon + 1;
    }
  }

  const size_t host_len = static_cast<size_t>(host_end - host_begin);
  if (host_len == 0 || host_len >= sizeof(endpoint.host)) return false;
  memcpy(endpoint.host, host_begin, host_len);
  endpoint.host[host_len] = '\0';

  if (port_begin) {
    if (port_begin >= authority_end) return false;
    char port_text[8] = {};
    const size_t port_len =
        static_cast<size_t>(authority_end - port_begin);
    if (port_len == 0 || port_len >= sizeof(port_text)) return false;
    memcpy(port_text, port_begin, port_len);
    char* port_end = nullptr;
    const unsigned long parsed = strtoul(port_text, &port_end, 10);
    if (!port_end || *port_end || parsed == 0 || parsed > UINT16_MAX) {
      return false;
    }
    endpoint.port = static_cast<uint16_t>(parsed);
  }

  const char* source_path = path ? path : "/";
  if (strlen(source_path) >= sizeof(endpoint.path)) return false;
  snprintf(endpoint.path, sizeof(endpoint.path), "%s", source_path);
  return true;
}

static int connect_http_socket(const HttpEndpoint& endpoint) {
  char port_text[8] = {};
  snprintf(port_text, sizeof(port_text), "%u",
           static_cast<unsigned>(endpoint.port));
  addrinfo hints{};
  hints.ai_family = AF_UNSPEC;
  hints.ai_socktype = SOCK_STREAM;
  hints.ai_protocol = IPPROTO_TCP;
  addrinfo* addresses = nullptr;
  const int lookup = getaddrinfo(endpoint.host, port_text, &hints, &addresses);
  if (lookup != 0 || !addresses) {
    Serial.printf("[CameraStream] HTTP DNS fehlgeschlagen: %d\n", lookup);
    return -1;
  }

  int connected_fd = -1;
  for (addrinfo* address = addresses; address; address = address->ai_next) {
    const int fd =
        socket(address->ai_family, address->ai_socktype, address->ai_protocol);
    if (fd < 0) continue;

    setsockopt(fd, SOL_SOCKET, SO_RCVBUF, &kHttpReceiveBufferBytes,
               sizeof(kHttpReceiveBufferBytes));
    const int original_flags = fcntl(fd, F_GETFL, 0);
    if (original_flags < 0 ||
        fcntl(fd, F_SETFL, original_flags | O_NONBLOCK) < 0) {
      close(fd);
      continue;
    }

