GalusPeres/ESP32-P4-HomeAssistant-Display/src/video/camera_stream.cpp
  uint8_t* input = static_cast<uint8_t*>(heap_caps_aligned_alloc(
      64, kMaxJpegBytes, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
  if (!input) {
    Serial.printf("[CameraStream] JPEG-Eingangspuffer (%u Bytes) fehlt\n",
                  static_cast<unsigned>(kMaxJpegBytes));
    set_status(camera_text().camera_input_memory_failed, true);
    finish_camera_task(socket_fd, nullptr);
    return;
  }

  set_status(camera_text().camera_buffering);
  JpegRecordStream jpeg_stream(input);
  HttpChunkedBodyDecoder chunk_decoder;
  bool stream_ok = true;
  uint32_t low_dma_headroom_since_ms = 0;
  const size_t body_offset = header_marker + 4;
  if (body_offset < header_bytes) {
    const uint8_t* body =
        reinterpret_cast<const uint8_t*>(header) + body_offset;
    const size_t body_bytes = header_bytes - body_offset;
    stream_ok = chunked
        ? chunk_decoder.feed(body, body_bytes, jpeg_stream)
        : jpeg_stream.write(body, body_bytes) == body_bytes;
  }
  while (!g_stop_requested && stream_ok) {
    const size_t dma_free = heap_caps_get_free_size(
        MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA);
    const size_t mqtt_dma_reserve = networkManager.mqttDmaReserveBytes();
    const size_t dma_headroom = dma_free + mqtt_dma_reserve;
    if (dma_headroom < kMinCameraDmaHeadroomBytes) {
      const uint32_t now = millis();
      if (low_dma_headroom_since_ms == 0) {
        low_dma_headroom_since_ms = now ? now : 1;
      } else if (
          static_cast<uint32_t>(now - low_dma_headroom_since_ms) >=
          kDmaHeadroomGraceMs) {
        Serial.printf(
            "[CameraStream] Sicherheitsstopp: DMA frei=%u KB Reserve=%u KB "
            "Headroom=%u KB seit %u ms; MQTT/WLAN bleiben aktiv\n",
            static_cast<unsigned>(dma_free / 1024U),
            static_cast<unsigned>(mqtt_dma_reserve / 1024U),
            static_cast<unsigned>(dma_headroom / 1024U),
            static_cast<unsigned>(now - low_dma_headroom_since_ms));
        set_status(camera_text().camera_connection_ended, true);
        stream_ok = false;
        break;
      }
    } else {
      low_dma_headroom_since_ms = 0;
    }
    const int received = recv(socket_fd, raw, sizeof(raw), 0);
    if (received == 0) break;
    if (received < 0) {
      if (errno != EINTR && errno != EAGAIN && errno != EWOULDBLOCK) {
        stream_ok = false;
        Serial.printf("[CameraStream] TCP-Empfangsfehler: errno=%d\n", errno);
        break;
      }
      taskYIELD();
      continue;
    }
    if (chunked) {
      if (!chunk_decoder.feed(raw, static_cast<size_t>(received),
                              jpeg_stream)) {
        stream_ok = false;
        break;
      }
    } else if (jpeg_stream.write(
                   raw, static_cast<size_t>(received)) !=
               static_cast<size_t>(received)) {
      stream_ok = false;
      break;
    }
  }
  Serial.printf("[CameraStream] HTTP-Stream beendet: ok=%s\n",
                stream_ok ? "ja" : "nein");

  if (g_stop_requested) {
    set_status(camera_text().camera_stream_stopped);
  } else {
    bool had_error = false;
    portENTER_CRITICAL(&g_state_mux);
    had_error = g_status_error;
    portEXIT_CRITICAL(&g_state_mux);
    if (!had_error) set_status(camera_text().camera_connection_ended, true);
  }
  finish_camera_task(socket_fd, input);
}

static void camera_task(void*) {
  // Keep all worker-owned objects inside this scope so cleanup completes
  // before FreeRTOS releases the PSRAM-backed task stack.
  run_camera_task();

  bool release_buffers = false;
  portENTER_CRITICAL(&g_state_mux);
  g_task = nullptr;
  release_buffers = g_release_buffers;
  portEXIT_CRITICAL(&g_state_mux);
  if (release_buffers) release_frame_buffers();
  vTaskDelete(nullptr);
}

}  // namespace

bool camera_stream_start(const char* url) {
  if (!url || !*url) {
    set_status(camera_text().camera_empty_url, true);
    return false;
  }
  if (task_is_active()) {
    set_status(camera_text().camera_already_running, true);
    return false;
  }
  if (!ensure_frame_buffers()) return false;
  Serial.printf(
      "[CameraStream] JPEG-Bildpuffer bereit: %u x %u Bytes, int=%uKB "
      "largest=%uKB psram=%uKB\n",
      static_cast<unsigned>(kFrameBufferCount),
      static_cast<unsigned>(kPixelBytes),
      static_cast<unsigned>(
          heap_caps_get_free_size(MALLOC_CAP_INTERNAL) / 1024U),
      static_cast<unsigned>(
          heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL) / 1024U),
      static_cast<unsigned>(
          heap_caps_get_free_size(MALLOC_CAP_SPIRAM) / 1024U));

  portENTER_CRITICAL(&g_state_mux);
  for (uint8_t i = 0; i < kFrameBufferCount; ++i) {
    g_frame_states[i] =
        (static_cast<int8_t>(i) == g_displayed_index)
            ? FrameState::Displayed
            : FrameState::Free;
  }
  g_release_buffers = false;
  portEXIT_CRITICAL(&g_state_mux);

  g_url = url;
  g_stop_requested = false;
  g_worker_frame_count = 0;
  const BaseType_t task_core = (ARDUINO_RUNNING_CORE == 0) ? 1 : 0;
  if (xTaskCreatePinnedToCoreWithCaps(
          camera_task, "cameraJpeg", 16384, nullptr, tskIDLE_PRIORITY,
          &g_task, task_core, MALLOC_CAP_SPIRAM) != pdPASS) {
    portENTER_CRITICAL(&g_state_mux);
    g_task = nullptr;
    g_release_buffers = true;
    portEXIT_CRITICAL(&g_state_mux);
    release_frame_buffers();
    set_status(camera_text().camera_task_start_failed, true);
    return false;
  }
  return true;
}

void camera_stream_stop() {
  const bool was_active = task_is_active();
  g_stop_requested = true;
  Serial.printf("[CameraStream] Stop angefordert (aktiv=%s)\n",
                was_active ? "ja" : "nein");
  bool active = false;
  portENTER_CRITICAL(&g_state_mux);
  g_release_buffers = true;
  active = g_task != nullptr;
  portEXIT_CRITICAL(&g_state_mux);
  if (!active) release_frame_buffers();
}

void camera_stream_process_ui(lv_obj_t* image,
                              lv_obj_t* placeholder,
                              lv_obj_t* status_label) {
  if (!image) return;
  int8_t ready = -1;
  // If the display PPA has entered its short self-healing cooldown, keep the
  // last frame. Repainting the full video area through the CPU fallback would
  // make every other LVGL interaction sluggish and fight the recovery.
  if (!Device::ppaCooldownActive()) {
    portENTER_CRITICAL(&g_state_mux);
    for (uint8_t i = 0; i < kFrameBufferCount; ++i) {
      if (g_frame_states[i] == FrameState::Ready) {
        ready = static_cast<int8_t>(i);
      }
    }
    if (ready >= 0) {
      if (g_displayed_index >= 0 &&
          g_displayed_index < static_cast<int8_t>(kFrameBufferCount) &&
          g_frame_states[g_displayed_index] == FrameState::Displayed) {
        g_frame_states[g_displayed_index] = FrameState::Free;
      }
      for (uint8_t i = 0; i < kFrameBufferCount; ++i) {
        if (static_cast<int8_t>(i) != ready &&
            g_frame_states[i] == FrameState::Ready) {
          g_frame_states[i] = FrameState::Free;
        }
      }
      g_frame_states[ready] = FrameState::Displayed;
      g_displayed_index = ready;
    }
    portEXIT_CRITICAL(&g_state_mux);
  }

